nrfconnect/sdk-nrf/applications/nrf5340_audio/src/audio/audio_datapath.c
	/*** Presentation delay measurement ***/
	ctrl_blk.current_pres_dly_us =
		frame_start_ts_us - ctrl_blk.out.prod_blk_ts[ctrl_blk.out.cons_blk_idx];

	/********** I2S TX **********/
	static uint8_t *tx_buf;

	if (IS_ENABLED(CONFIG_STREAM_BIDIRECTIONAL) || (CONFIG_AUDIO_DEV == HEADSET)) {
		static bool underrun_condition;

		if (tx_buf_released == NULL) {
			ERR_CHK_MSG(-ENOMEM, "No TX data available");
		}

		/* Double buffered index */
		uint32_t next_out_blk_idx = NEXT_IDX(ctrl_blk.out.cons_blk_idx);

		if (next_out_blk_idx != ctrl_blk.out.prod_blk_idx) {
			/* Only increment if not in under-run condition */
			ctrl_blk.out.cons_blk_idx = next_out_blk_idx;
			if (underrun_condition) {
				underrun_condition = false;
				LOG_WRN("Data received, total under-runs: %d",
					ctrl_blk.out.total_blk_underruns);
			}

			tx_buf = (uint8_t *)&ctrl_blk.out
					 .fifo[next_out_blk_idx * BLK_MULTI_CHAN_NUM_SAMPS];

		} else {
			if (stream_state_get() == STATE_STREAMING) {
				underrun_condition = true;
				ctrl_blk.out.total_blk_underruns++;

				if ((ctrl_blk.out.total_blk_underruns % LOG_INTERVAL_BLKS) == 0) {
					LOG_WRN("In I2S TX under-run condition, total: %d",
						ctrl_blk.out.total_blk_underruns);
				}
			}

			/*
			 * No data available in out.fifo
			 * use alternative buffers
			 */
			ret = alt_buffer_get((void **)&tx_buf);
			ERR_CHK(ret);

			memset(tx_buf, 0, BLK_MULTI_CHAN_SIZE_OCTETS);
		}

		if (tone_active) {
			tone_mix(tx_buf);
		}
	}

	/********** I2S RX **********/
	static uint32_t num_overruns;
	static uint32_t num_overruns_last_printed;

	if (IS_ENABLED(CONFIG_STREAM_BIDIRECTIONAL) || (CONFIG_AUDIO_DEV == GATEWAY)) {
		if (unlikely(rx_buf_released == NULL)) {
			ERR_CHK_MSG(-ENOMEM, "No RX data available");
		}

		if (atomic_get(&drop_next_block)) {
			/* Drop this block to align with just-in-time */
			atomic_set(&drop_next_block, false);
			goto i2s_rx_done;
		}

		/* Allocate new frame if we don't have one */
		if (i2s_current_frame == NULL) {
			/* Check space availability */
			i2s_current_frame = net_buf_alloc(&pool_i2s_rx, K_NO_WAIT);
			if (unlikely(i2s_current_frame == NULL)) {
				LOG_DBG("Out of I2S RX buffers for frame");
				if (unlikely((++num_overruns % 100) == 1)) {
					LOG_WRN("I2S RX overrun count: %d", num_overruns);
				}

				goto i2s_rx_done;
			}

			/* Initialize metadata for the first block */
			struct audio_metadata *meta = net_buf_user_data(i2s_current_frame);
			*meta = i2s_meta;
			meta->data_len_us = 0;
			meta->bytes_per_location = 0;
			i2s_blocks_in_current_frame = 0;
		}

		/* Add block data directly to current frame */
		net_buf_add_mem(i2s_current_frame, rx_buf_released, BLK_MULTI_CHAN_SIZE_OCTETS);

		/* Update metadata */
		struct audio_metadata *meta = net_buf_user_data(i2s_current_frame);

		meta->data_len_us += i2s_meta.data_len_us; /* Each block is 1ms */
		meta->bytes_per_location += i2s_meta.bytes_per_location;
		i2s_blocks_in_current_frame++;

		/* Check if we have a complete 10ms frame */
		if (i2s_blocks_in_current_frame >= CONFIG_FIFO_FRAME_SPLIT_NUM) {
			if (unlikely(k_msgq_num_free_get(ctrl_blk.in.audio_q) == 0)) {
				LOG_DBG("RX queue full, dropping I2S RX frame");
				if (unlikely((++num_overruns % 100) == 1)) {
					LOG_WRN("I2S RX overrun count: %d", num_overruns);
				}

				/* Remove latest block to delay frame completion until message
				 * queue is ready
				 */
				net_buf_remove_mem(i2s_current_frame, BLK_MULTI_CHAN_SIZE_OCTETS);
				meta->data_len_us -= i2s_meta.data_len_us; /* Each block is 1ms */
				meta->bytes_per_location -= i2s_meta.bytes_per_location;
				i2s_blocks_in_current_frame--;

				goto i2s_rx_done;
			}

			/* Put complete frame into RX queue */
			ret = k_msgq_put(ctrl_blk.in.audio_q, (void *)&i2s_current_frame,
					 K_NO_WAIT);
			if (ret) {
				LOG_ERR("Unable to put I2S complete frame into queue");
				net_buf_unref(i2s_current_frame);
			}

			/* Reset for next frame */
			i2s_current_frame = NULL;
			i2s_blocks_in_current_frame = 0;
		}

i2s_rx_done:
		/* Print overrun stats periodically */
		if ((num_calls % LOG_INTERVAL_BLKS == 0) &&
		    (num_overruns != num_overruns_last_printed)) {
			num_overruns_last_printed = num_overruns;
		}
	}

	/*** Data exchange ***/
	audio_i2s_set_next_buf(tx_buf, rx_buf_released);

	/*** Drift compensation ***/
	if (ctrl_blk.drift_comp.enabled) {
		audio_datapath_drift_compensation(frame_start_ts_us);
	}
}

static void audio_datapath_i2s_start(void)
{
	/* Double buffer I2S */
	uint8_t *tx_buf_0 = NULL;
	uint8_t *tx_buf_1 = NULL;

	/* Buffers used for I2S RX. Used interchangeably by I2S. */
	static uint32_t rx_buf_0[BLK_MULTI_CHAN_SIZE_OCTETS];
	static uint32_t rx_buf_1[BLK_MULTI_CHAN_SIZE_OCTETS];

	/* TX */
	if (IS_ENABLED(CONFIG_STREAM_BIDIRECTIONAL) || (CONFIG_AUDIO_DEV == HEADSET)) {
		ctrl_blk.out.cons_blk_idx = PREV_IDX(ctrl_blk.out.cons_blk_idx);
		tx_buf_0 = (uint8_t *)&ctrl_blk.out
				   .fifo[ctrl_blk.out.cons_blk_idx * BLK_MULTI_CHAN_NUM_SAMPS];

		ctrl_blk.out.cons_blk_idx = PREV_IDX(ctrl_blk.out.cons_blk_idx);
		tx_buf_1 = (uint8_t *)&ctrl_blk.out
				   .fifo[ctrl_blk.out.cons_blk_idx * BLK_MULTI_CHAN_NUM_SAMPS];
	}

	/* Start I2S */
	audio_i2s_start(tx_buf_0, rx_buf_0);
	audio_i2s_set_next_buf(tx_buf_1, rx_buf_1);
}

static void audio_datapath_i2s_stop(void)
{
	audio_i2s_stop();
	alt_buffer_free_both();
}

/**
 * @brief	Adjust timing to make sure audio data is sent just in time for Bluetooth LE event.
 *
 * @note	The time from last anchor point is checked and then blocks of 1 ms can be dropped to
 *		allow the sending of encoded data to be sent just before the connection interval
 *		opens up. This is done to reduce overall latency.
 *
 * @param[in]	tx_sync_ts_us	The timestamp from get_tx_sync.
 * @param[in]	curr_ts_us	The current time. This must be in the controller frame of reference.
 */
static void audio_datapath_just_in_time_check_and_adjust(uint32_t tx_sync_ts_us,
							 uint32_t curr_ts_us)
{
	static int32_t print_count;
	int64_t diff;

	diff = (int64_t)tx_sync_ts_us - curr_ts_us;

