nrfconnect/sdk-nrf/applications/nrf5340_audio/src/audio/audio_datapath.c
	/*
	 * The diff should always be positive. If diff is a large negative number, it
	 * is likely that wrapping has occurred. A small negative value however, may
	 * point to the application sending data too late, and we need to drop data to
	 * get back in sync with the controller.
	 */
	if (diff < -((int64_t)UINT32_MAX / 2)) {
		LOG_DBG("Timestamp wrap. diff: %lld", diff);
		diff += UINT32_MAX;

	} else if (diff < 0) {
		LOG_DBG("tx_sync_ts_us: %u is earlier than curr_ts_us %u", tx_sync_ts_us,
			curr_ts_us);
	}

	if (print_count % 100 == 0) {
		LOG_DBG("JIT diff: %lld us. Target: %u +/- %u", diff, JUST_IN_TIME_TARGET_DLY_US,
			JUST_IN_TIME_BOUND_US);
	}
	print_count++;

	if ((diff < (JUST_IN_TIME_TARGET_DLY_US - JUST_IN_TIME_BOUND_US)) ||
	    (diff > (JUST_IN_TIME_TARGET_DLY_US + JUST_IN_TIME_BOUND_US))) {
		/* Drop next block to help with just-in-time */
		atomic_set(&drop_next_block, true);
		LOG_DBG("Dropped block to align with connection interval");
		print_count = 0;
	}
}

/**
 * @brief	Update sdu_ref_us so that drift compensation can work correctly.
 *
 * @note	This function is only valid for gateway using I2S as audio
 *		source and unidirectional audio stream (gateway to one or more headsets).
 *
 * @param	sdu_ref_us	ISO timestamp reference from Bluetooth LE controller.
 * @param	adjust		Indicate if the sdu_ref should be used to adjust timing.
 */
static void audio_datapath_sdu_ref_update(const struct zbus_channel *chan)
{
	if (IS_ENABLED(CONFIG_AUDIO_SOURCE_I2S)) {
		uint32_t tx_sync_ts_us;
		uint32_t curr_ts_us;
		bool adjust;
		const struct sdu_ref_msg *msg;

		msg = zbus_chan_const_msg(chan);
		tx_sync_ts_us = msg->tx_sync_ts_us;
		curr_ts_us = msg->curr_ts_us;
		adjust = msg->adjust;

		if (ctrl_blk.stream_started) {
			ctrl_blk.prev_drift_sdu_ref_us = tx_sync_ts_us;

			if (adjust && tx_sync_ts_us != 0) {
				audio_datapath_just_in_time_check_and_adjust(tx_sync_ts_us,
									     curr_ts_us);
			}
		} else {
			LOG_WRN("Stream not started - Can not update tx_sync_ts_us");
		}
	}
}

ZBUS_LISTENER_DEFINE(sdu_ref_msg_listen, audio_datapath_sdu_ref_update);

int audio_datapath_pres_delay_us_set(uint32_t delay_us)
{
	if (!IN_RANGE(delay_us, CONFIG_AUDIO_MIN_PRES_DLY_US, CONFIG_AUDIO_MAX_PRES_DLY_US)) {
		LOG_WRN("Presentation delay not supported: %d us", delay_us);
		LOG_WRN("Keeping current value: %d us", ctrl_blk.pres_comp.pres_delay_us);
		return -EINVAL;
	}

	ctrl_blk.pres_comp.pres_delay_us = delay_us;

	LOG_DBG("Presentation delay set to %d us", delay_us);

	return 0;
}

void audio_datapath_pres_delay_us_get(uint32_t *delay_us)
{
	*delay_us = ctrl_blk.pres_comp.pres_delay_us;
}

void audio_datapath_stream_out(struct net_buf *audio_frame_in)
{
	bool sdu_ref_not_consecutive = false;

	if (!ctrl_blk.stream_started) {
		LOG_WRN("Stream not started");
		return;
	}

	if (audio_frame_in == NULL) {
		LOG_ERR("Audio frame is NULL");
		return;
	}

	/*** Check incoming data ***/
	struct audio_metadata *meta_in = net_buf_user_data(audio_frame_in);

	if (meta_in->ref_ts_us == ctrl_blk.prev_pres_sdu_ref_us && meta_in->ref_ts_us != 0) {
		LOG_WRN("Duplicate sdu_ref_us (%d) - Dropping audio frame", meta_in->ref_ts_us);
		return;
	}

	uint32_t sdu_ref_delta_us = meta_in->ref_ts_us - ctrl_blk.prev_pres_sdu_ref_us;

	if (meta_in->ref_ts_us == 0 && ctrl_blk.prev_pres_sdu_ref_us == 0) {
		/* Timestamp not received yet */
		ctrl_blk.prev_pres_sdu_ref_us = meta_in->ref_ts_us;
		sdu_ref_not_consecutive = true;

	} else if (sdu_ref_delta_us > CONSECUTIVE_TS_LIMIT_US) {
		/* If the new timestamp is not consecutive wrt. the previous timestamp */
		if (consec_invalid_ts_deltas) {
			LOG_ERR("sdu_ref_us not from consecutive frames (delta: %d us)",
				sdu_ref_delta_us);
		} else {
			LOG_DBG("sdu_ref_us not from consecutive frames (delta: %d us)",
				sdu_ref_delta_us);
		}

		sdu_ref_not_consecutive = true;
		ctrl_blk.prev_pres_sdu_ref_us = meta_in->ref_ts_us;
		consec_invalid_ts_deltas++;

	} else if (!IN_RANGE(sdu_ref_delta_us,
			     CONFIG_AUDIO_FRAME_DURATION_US - SDU_REF_CH_DELTA_MAX_US,
			     CONFIG_AUDIO_FRAME_DURATION_US + SDU_REF_CH_DELTA_MAX_US)) {
		/* If timestamp is consecutive but has invalid delta: Estimate the timestamp
		 */
		if (consec_invalid_ts_deltas) {
			LOG_ERR("Invalid sdu_ref_us delta (%d) meta_in->ref_ts_us %d us. "
				"Estimating.",
				sdu_ref_delta_us, meta_in->ref_ts_us);
		} else {
			LOG_DBG("Invalid sdu_ref_us delta (%d) meta_in->ref_ts_us %d us. "
				"Estimating.",
				sdu_ref_delta_us, meta_in->ref_ts_us);
		}

		/* Estimate ref_ts_us.
		 * If the SDU ref was estimated, we don't update the previous reference with
		 * the estimated value. This is to avoid an infinite loop of estimations.
		 */
		uint32_t ref_ts_temp_us = meta_in->ref_ts_us;

		meta_in->ref_ts_us = ctrl_blk.prev_pres_sdu_ref_us + CONFIG_AUDIO_FRAME_DURATION_US;
		ctrl_blk.prev_pres_sdu_ref_us = ref_ts_temp_us;

		consec_invalid_ts_deltas++;
	} else {
		/* The new timestamp is valid. It is consecutive and
		 * within the expected range compared to the last timestamp.
		 */
		ctrl_blk.prev_pres_sdu_ref_us = meta_in->ref_ts_us;
		consec_invalid_ts_deltas = 0;
	}

	/*** Presentation compensation ***/
	if (ctrl_blk.pres_comp.enabled) {
		audio_datapath_presentation_compensation(meta_in->data_rx_ts_us, meta_in->ref_ts_us,
							 sdu_ref_not_consecutive);
	}

	/*** Decode ***/

	int ret;
	struct net_buf *audio_frame_out = net_buf_alloc(&audio_pcm_pool, K_NO_WAIT);

	if (audio_frame_out == NULL) {
		LOG_ERR("Out of I2S PCM TX buffers.");
		return;
	}

	/* Output I2S related metadata */
	struct audio_metadata *meta_out = net_buf_user_data(audio_frame_out);
	*meta_out = i2s_meta;
	meta_out->data_len_us = meta_in->data_len_us;
	meta_out->ref_ts_us = meta_in->ref_ts_us;
	meta_out->data_rx_ts_us = meta_in->data_rx_ts_us;
	meta_out->bad_data = meta_in->bad_data;

	ret = sw_codec_decode(audio_frame_in, audio_frame_out);
	if (ret) {
		net_buf_unref(audio_frame_out);
		LOG_WRN("SW codec decode error: %d", ret);
		return;
	}

	if (IS_ENABLED(CONFIG_SD_CARD_PLAYBACK)) {
		if (sd_card_playback_is_active()) {
			sd_card_playback_mix_with_stream((void *const)audio_frame_out->data,
							 audio_frame_out->len);
		}
	}

